[Killed] BlockStatement
fn.js:7:28
  * @param {number} key - Elementul de căutat.
  * @returns {number} - Indicele elementului dacă există, sau -1 dacă nu există.
  */
-function findIndex(v, key) {
-    if (v.length !== 5) {
-        throw new Error("Vectorul trebuie să aibă exact 5 elemente.");
-    }
-    return v.indexOf(key);
-}
+function findIndex(v, key) {}
 
 module.exports = findIndex;
killedBy: Testează funcția findIndex Test cu vector [1,2,3,4,5] și cheia 3
statusReason: Expected values to be strictly equal:

undefined !== 2

[Killed] ConditionalExpression
fn.js:8:9
  * @returns {number} - Indicele elementului dacă există, sau -1 dacă nu există.
  */
 function findIndex(v, key) {
-    if (v.length !== 5) {
+    if (true) {
         throw new Error("Vectorul trebuie să aibă exact 5 elemente.");
     }
killedBy: Testează funcția findIndex Test cu vector [1,2,3,4,5] și cheia 3
statusReason: Vectorul trebuie să aibă exact 5 elemente.

[Killed] BlockStatement
fn.js:8:25
  * @returns {number} - Indicele elementului dacă există, sau -1 dacă nu există.
  */
 function findIndex(v, key) {
-    if (v.length !== 5) {
-        throw new Error("Vectorul trebuie să aibă exact 5 elemente.");
-    }
+    if (v.length !== 5) {}
     return v.indexOf(key);
 }
killedBy: Testează funcția findIndex Test cu vector [1,2,3] și cheia 2
statusReason: Missing expected exception.

[Killed] StringLiteral
fn.js:9:25
  */
 function findIndex(v, key) {
     if (v.length !== 5) {
-        throw new Error("Vectorul trebuie să aibă exact 5 elemente.");
+        throw new Error("");
     }
     return v.indexOf(key);
killedBy: Testează funcția findIndex Test cu vector [1,2,3] și cheia 2
statusReason: The input did not match the regular expression /Vectorul trebuie să aibă exact 5 elemente./. Input:

'Error'
